app/views/notes/update.js.erb

/*$("form").bind('ajax:success', function() {
    if($(this).contents('div.note').contents('textarea')!=null){
        var p= "<p class='note-text mt-3'>"+note_text.value+"</p>";
        $(this).contents('div.note').contents('textarea').replaceWith(p);
        $(this).contents('div.note').contents('.deleteLink').removeClass('d-none');
        $(this).contents('div.note').contents('.confirmButton').addClass('d-none');
        $(this).contents('div.note').contents('.modifyLink').removeClass('d-none');
    }
});*/
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]