app/views/users/destroy.js.erb

$('.deleteUser').bind('ajax:success', function() {
   $(this).closest('li').fadeOut();
});
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]