app/controllers/notes_controller.rb

  def index
    @notes = Note.where("user_id = #{session[:user_id]}")
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    requestNote = params.require(:note).permit(:note_text)
    requestNote[:user_id]=session[:user_id]
    @note = Note.create(requestNote)
---
INSERT INTO "notes" ("note_text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["note_text", "second note"], ["user_id", "1"], ["created_at", "2020-06-09 14:15:10.243443"], ["updated_at", "2020-06-09 14:15:10.243443"]]

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 6]]

  def update
    noteOld = Note.find(params[:id])
    noteNew = params.require(:note).permit(:note_text)
    noteOld.update(noteNew)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "notes" SET "note_text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["note_text", "Many will call me an adventurer, and that I am...only one of a different sort: one who risks his skin to prove his truths."], ["updated_at", "2020-06-11 19:56:46.294427"], ["id", 7]]

  def noteChange
    @note = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def noteMod
    noteOld = Note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    noteOld = Note.find(params[:id])
    noteNew = {}
    puts("update run");
    noteNew[:note_text] = params[:note_text]
    noteOld.update(noteNew)
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "notes" SET "note_text" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["note_text", nil], ["updated_at", "2020-06-11 09:14:40.198282"], ["id", 7]]