app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "user_role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    userNew = params.require(:user).permit(:username, :password)
    userNew[:user_role] = "teamMember"
    @user = User.create(userNew)

INSERT INTO "users" ("username", "password_digest", "user_role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def createAdmin
    userNew = {}
    userNew[:username] = params.require(:username)
    userNew[:password] = params.require(:password)
    if(params.has_key?(:user_role)) then
      userNew[:user_role] = params.require(:user_role)
      if(userNew[:user_role]) then
        userNew[:user_role] = "admin"
      else
        userNew[:user_role] = "teamMember"
      end
    else
      userNew[:user_role] = "teamMember"
    end
    @user = User.create(userNew)

SELECT "users".* FROM "users"
---
  def index
    if admin?
      @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 3]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", "11"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 11]]
---
  def destroy
    @user = User.find(params[:id])
    Note.where(:user_id => params[:id]).destroy_all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def updateView
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$vdOgXRf52q/s.//e6QAEwOmIf6cCPYjPg/Ui22lCboaSPMw3cerKK"], ["updated_at", "2020-06-10 17:37:18.191131"], ["id", 14]]
---
  def update
    userOld = User.find(params[:id])
    userNew = {}
    userNew[:username] = params.require(:username)
    userNew[:password] = params.require(:password)
    if(params.has_key?(:user_role)) then
      userNew[:user_role] = params.require(:user_role)
    end
    userOld.update(userNew)